examples/dfHighSpeedFoam/oneD_detC7H16Mist/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (100   0  0)
    (450   0  0)
    (450   1  0)
    (100   1  0)
    (100   0  0.1)
    (450   0  0.1)
    (450   1  0.1)
    (100   1  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Left
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
        );
    }
    Right
    {
        type symmetryPlane;
        faces
        (
            (1 2 6 5)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
