examples/dfHighSpeedFoam/oneD_detC7H16Mist/0_orig/C7H16
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C7H16;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField       uniform 0.06220;

boundaryField
{
    Left
    {
        type            symmetryPlane;
    }
    Right
    {
        type            symmetryPlane;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
