examples/dfHighSpeedFoam/oneD_detC7H16Mist/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme		Kurganov;

ddtSchemes
{
    // default         Euler;
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default               none;
    div(tauMC)            Gauss linear;
    div(hDiffCorrFlux)    Gauss cubic;
    div(phi,Yi_h)         Gauss vanLeer;

    // div(phi,U)      Gauss upwind;
    // div(phid,p)     Gauss upwind;
    // div(phi,K)      Gauss linear;
    // div(phi,k)      Gauss upwind;
    // div(phi,epsilon) Gauss upwind;
    // div(U)          Gauss linear;
    // div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    // div(phi,Yi_h)   Gauss upwind;
    // div(hDiffCorrFlux) Gauss cubic;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho)      Minmod;
    reconstruct(U)        MinmodV;
    reconstruct(e)        Minmod;
    reconstruct(p)        Minmod;
    reconstruct(c)        Minmod;
    reconstruct(Yi)       Minmod;
    reconstruct(T)        Minmod;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
