examples/dfHighSpeedFoam/oneD_detC7H16Mist/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// defaultFieldValues
// (
//     volVectorFieldValue U (0 0 0)
//     volScalarFieldValue T 300
//     volScalarFieldValue p 101325
// );

regions
(
    boxToCell
    {
        box (1.0 0 0) (1.02 0.01 0.001);
        fieldValues
        (
            volScalarFieldValue T 2500
            volScalarFieldValue p 5e+6
        );
    }

    boxToCell
    {
        box (1.5 0 0) (4.5 0.01 0.001); //background phi=0.6
        fieldValues
        (
            volScalarFieldValue T 300
            volScalarFieldValue p 100000
            volVectorFieldValue U (0 0 0)
            volScalarFieldValue C7H16 0.03828
            volScalarFieldValue O2 0.22408
            volScalarFieldValue N2 0.73764
        );
    }
);


// ************************************************************************* //
